age = 38
name = "Dimion"

print("Мне {1} и меня зовут {0}".format(name, age))
# ----------------------------------------------------------
# десятичное число (.) с точностью в 3 знака для плавающих:
print("{0:.3}".format(1/3))
# ----------------------------------------------------------
# заполнить подчёркиваниями (_) с центровкой текста (^) по ширине 11:
print("{0:_^11}".format("hello"))
# ----------------------------------------------------------
# по ключевым словам:
print("{name} написал {message}".format(name="Dimion", message="sms"))

